## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "4jj-dh7-k8z"
        tags                    = []
        # (9 unchanged attributes hidden)

      ~ widget {
            id = 6190250857438759

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 3594760473390401

                  ~ widget_layout {
                      ~ height          = 6 -> 9
                        # (4 unchanged attributes hidden)
                    }

                    # (1 unchanged block hidden)
                }
+               widget {
+                   sunburst_definition {
+                       hide_total = false
+                       title      = "Grant Events Published in Period"

+                       legend_inline {
+                           hide_percent = false
+                           hide_value   = false
+                           type         = "inline"
                        }

+                       request {
+                           formula {
+                               formula_expression = "published_by_type"
                            }
+                           query {
+                               metric_query {
+                                   aggregator  = "sum"
+                                   data_source = "metrics"
+                                   name        = "published_by_type"
+                                   query       = "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service} by {type}.as_count()"
                                }
                            }
                        }
                    }
+                   widget_layout {
+                       height = 3
+                       width  = 4
+                       x      = 8
+                       y      = 6
                    }
                }

                # (1 unchanged block hidden)
            }

          ~ widget_layout {
              ~ height          = 6 -> 9
                # (4 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 2831510928914377

          ~ widget_layout {
              ~ y               = 6 -> 9
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 5118986428320093

          ~ widget_layout {
              ~ y               = 9 -> 12
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 8822803443740437

          ~ widget_layout {
              ~ y               = 12 -> 15
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 7431367349261418

          ~ widget_layout {
              ~ y               = 15 -> 18
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 730363774235351

          ~ widget_layout {
              ~ y               = 18 -> 21
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 3936983417003663

          ~ widget_layout {
              ~ y               = 21 -> 24
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 785553859603044

          ~ widget_layout {
              ~ y               = 24 -> 27
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 2431329390462335

          ~ group_definition {
                # (3 unchanged attributes hidden)

              ~ widget {
                    id = 7734474858887144

                  ~ timeseries_definition {
                        # (4 unchanged attributes hidden)

                      ~ request {
                            # (2 unchanged attributes hidden)

                          ~ formula {
                              ~ formula_expression = "published" -> "published_by_event_type"
                                # (1 unchanged attribute hidden)

                                # (1 unchanged block hidden)
                            }
                          ~ formula {
                              ~ formula_expression = "total_in_invocation - published - failed" -> "total_in_invocation - published_total - failed"
                                # (1 unchanged attribute hidden)

                                # (1 unchanged block hidden)
                            }

                          ~ query {
                              ~ metric_query {
                                  ~ name        = "published" -> "published_by_event_type"
                                  ~ query       = "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service,$version}.as_count()" -> "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service,$version} by {type}.as_count()"
                                    # (1 unchanged attribute hidden)
                                }
                            }
+                           query {
+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "published_total"
+                                   query       = "sum:grants_ingest.PublishGrantEvents.event.published{$env,$service,$version}.as_count()"
                                }
                            }

                            # (3 unchanged blocks hidden)
                        }

                        # (1 unchanged block hidden)
                    }

                    # (1 unchanged block hidden)
                }

                # (7 unchanged blocks hidden)
            }

          ~ widget_layout {
              ~ y               = 30 -> 33
                # (4 unchanged attributes hidden)
            }
        }
      ~ widget {
            id = 3955642557463371

          ~ widget_layout {
              ~ y               = 43 -> 46
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 3296675294527889

          ~ widget_layout {
              ~ y               = 46 -> 49
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
      ~ widget {
            id = 3076778952539029

          ~ widget_layout {
              ~ y               = 52 -> 55
                # (4 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "259c5d1abd973a6d69e82eaee2139fc5-3" -> (known after apply)
      ~ id                     = "87f676bc66e1cd463c45d66d5ac34c2e.zip" -> (known after apply)
      ~ key                    = "87f676bc66e1cd463c45d66d5ac34c2e.zip" -> "118dbcbf6cb0d697854706b9fa8e1825.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "f.7sQoI.xgictMY11qDwnr10sflRlP5m" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-11-15T13:07:48.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadFFISSpreadsheet:40/invocations" -> (known after apply)
      ~ s3_key                         = "87f676bc66e1cd463c45d66d5ac34c2e.zip" -> "118dbcbf6cb0d697854706b9fa8e1825.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "bfedf2c45be284c9df22977803e17bd9-3" -> (known after apply)
      ~ id                     = "123c409c86da87490d561a776b602b26.zip" -> (known after apply)
      ~ key                    = "123c409c86da87490d561a776b602b26.zip" -> "1e8485fab8f36ae9800e66e32e3fb5b0.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "kv6hgQ34EW1g7s.Uetzv8yEiqiMwNW9y" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-11-15T13:07:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-DownloadGrantsGovDB:40/invocations" -> (known after apply)
      ~ s3_key                         = "123c409c86da87490d561a776b602b26.zip" -> "1e8485fab8f36ae9800e66e32e3fb5b0.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "cd2b9514a1472e787ec581dd06780b01-3" -> (known after apply)
      ~ id                     = "ddfc82d52aea92f01d593985ff1c2e08.zip" -> (known after apply)
      ~ key                    = "ddfc82d52aea92f01d593985ff1c2e08.zip" -> "6738a6c1ba00cad79c7b511f01450f96.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "zMs7cQsG35pG0XKfF_koPkUt9IYPokI5" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2023-11-15T13:07:52.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-EnqueueFFISDownload:40/invocations" -> (known after apply)
      ~ s3_key                         = "ddfc82d52aea92f01d593985ff1c2e08.zip" -> "6738a6c1ba00cad79c7b511f01450f96.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f164209f3ee41744c49b5f6435064f82-3" -> (known after apply)
      ~ id                     = "22727beabcc276c85ec71cfb71993bb6.zip" -> (known after apply)
      ~ key                    = "22727beabcc276c85ec71cfb71993bb6.zip" -> "aea8b88ce8423298e244a27d97fbadcb.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "09YpqRNlxQERsNKEuiWVY.niYAUEIo28" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-11-15T13:07:48.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ExtractGrantsGovDBToXML:40/invocations" -> (known after apply)
      ~ s3_key                         = "22727beabcc276c85ec71cfb71993bb6.zip" -> "aea8b88ce8423298e244a27d97fbadcb.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "edcd46f9b654e0402f1256665e76002a-3" -> (known after apply)
      ~ id                     = "8a12effd1536f9b8848de6ba383d329b.zip" -> (known after apply)
      ~ key                    = "8a12effd1536f9b8848de6ba383d329b.zip" -> "a5fba47653a04d88a1a32457f98d4a1b.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "hA63iLU.hJGM7WajGgNsLjeflMo.Sz7N" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2023-11-15T13:07:48.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistFFISData:40/invocations" -> (known after apply)
      ~ s3_key                         = "8a12effd1536f9b8848de6ba383d329b.zip" -> "a5fba47653a04d88a1a32457f98d4a1b.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "eea5ca3f48e50316b4328af268c1968c-3" -> (known after apply)
      ~ id                     = "fc7557e40c69ab333d608214acf87716.zip" -> (known after apply)
      ~ key                    = "fc7557e40c69ab333d608214acf87716.zip" -> "4254b7f576ff5303ffc9ef4f0e17ea0e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "loLpHxan9iRwtHT2XzVnci3E.x0V9kIv" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-11-15T13:07:48.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PersistGrantsGovXMLDB:40/invocations" -> (known after apply)
      ~ s3_key                         = "fc7557e40c69ab333d608214acf87716.zip" -> "4254b7f576ff5303ffc9ef4f0e17ea0e.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e073c5f25492b525019f8d5e7b95e5eb-3" -> (known after apply)
      ~ id                     = "c34668e756f10a9bddf8bf4f1ba70473.zip" -> (known after apply)
      ~ key                    = "c34668e756f10a9bddf8bf4f1ba70473.zip" -> "7b3bb38d73a36b6037d00367e29f1707.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Hx98IS4xcstRE3s3b_Neg7zNlAnMnYRA" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2023-11-15T13:07:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:41" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-PublishGrantEvents:41/invocations" -> (known after apply)
      ~ s3_key                         = "c34668e756f10a9bddf8bf4f1ba70473.zip" -> "7b3bb38d73a36b6037d00367e29f1707.zip"
        tags                           = {}
      ~ version                        = "41" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:publishgrantevents"
              ~ "DD_VERSION"                   = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (11 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "41" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d199075c04ba8c89b88ea4aa08ac43ed-3" -> (known after apply)
      ~ id                     = "115011292f90ca1f0d172dc49373cce7.zip" -> (known after apply)
      ~ key                    = "115011292f90ca1f0d172dc49373cce7.zip" -> "25130ab4f3414c6d61d71b1e819ba436.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "PExU8Nza63QXR0u.FgKBbFbMseZghW61" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2023-11-15T13:07:48.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:39" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-ReceiveFFISEmail:39/invocations" -> (known after apply)
      ~ s3_key                         = "115011292f90ca1f0d172dc49373cce7.zip" -> "25130ab4f3414c6d61d71b1e819ba436.zip"
        tags                           = {}
      ~ version                        = "39" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:receiveffisemail"
              ~ "DD_VERSION"                     = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "39" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6df8dca45490906e0f3c95682e1eedc4-3" -> (known after apply)
      ~ id                     = "3e9ba9ea945b22cf7978baef9b6a0315.zip" -> (known after apply)
      ~ key                    = "3e9ba9ea945b22cf7978baef9b6a0315.zip" -> "14ba106b585d11f4447fa42bd6caae1a.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "wuQ15g6p7KBbJ7Q1S55Abv4FJw03yRcM" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-11-15T13:07:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitFFISSpreadsheet:40/invocations" -> (known after apply)
      ~ s3_key                         = "3e9ba9ea945b22cf7978baef9b6a0315.zip" -> "14ba106b585d11f4447fa42bd6caae1a.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "485edea0e1fcaf312d398e2ee0aa0a3d-3" -> (known after apply)
      ~ id                     = "32dd20f3998f7d4fbcd9acd85cb121d6.zip" -> (known after apply)
      ~ key                    = "32dd20f3998f7d4fbcd9acd85cb121d6.zip" -> "d006db01a81c1a6f502aa7409bc48f26.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Dtq8JtKNjaQzQ7pVXnhpQUuuCu1B65RF" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-11-15T13:07:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:40" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-SplitGrantsGovXMLDB:40/invocations" -> (known after apply)
      ~ s3_key                         = "32dd20f3998f7d4fbcd9acd85cb121d6.zip" -> "d006db01a81c1a6f502aa7409bc48f26.zip"
        tags                           = {}
      ~ version                        = "40" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:f9825667bd5af760860985b869dafe5ba952b6b7,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:e7fd803e6b420ab48a5261272b24c5abddc2d849,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "f9825667bd5af760860985b869dafe5ba952b6b7" -> "e7fd803e6b420ab48a5261272b24c5abddc2d849"
                # (14 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "40" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 20 to add, 11 to change, 20 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/6885592269)*